; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v2 ?v5)
             (pred_6 ?v3 ?v4)
             (pred_5 ?v2 ?v4)
             (pred_1 ?v6 ?v2 )
	     (pred_11 ?v2)
             (pred_4 ?v7)
             (pred_8 ?v3)
             (pred_7 ?v4)
             (pred_3 ?v2)
             (pred_9 ?v3)
             (pred_2 ?v2)
             (pred_12 ))



(:action op_5
:parameters (?v1 ?v13 ?v8 ?v11)
:precondition (and (pred_4 ?v1) (pred_4 ?v13) (pred_8 ?v8) (pred_7 ?v11)
          (pred_10 ?v1 ?v13) (pred_6 ?v8 ?v11)
                   (pred_5 ?v13 ?v11) (pred_11 ?v1) 
                   (pred_3 ?v13) (pred_9 ?v8))
:effect (and  (pred_2 ?v13) (not (pred_3 ?v13))))


(:action op_2
:parameters (?v1 ?v9)
:precondition (and (pred_4 ?v1) (pred_4 ?v9)
               (pred_11 ?v1) (pred_10 ?v1 ?v9) (pred_2 ?v9))
:effect (and (pred_11 ?v9) (not (pred_11 ?v1))))

(:action op_1
:parameters (?v1 ?v8)
:precondition (and (pred_4 ?v1) (pred_8 ?v8) 
                  (pred_11 ?v1) (pred_1 ?v8 ?v1) (pred_12 ))
:effect (and (pred_9 ?v8)
   (not (pred_1 ?v8 ?v1)) (not (pred_12 ))))


(:action op_4
:parameters (?v1 ?v10 ?v12)
:precondition (and (pred_4 ?v1) (pred_8 ?v10) (pred_8 ?v12)
                  (pred_11 ?v1) (pred_9 ?v12) (pred_1 ?v10 ?v1))
:effect (and (pred_9 ?v10) (pred_1 ?v12 ?v1)
        (not (pred_9 ?v12)) (not (pred_1 ?v10 ?v1))))

(:action op_3
:parameters (?v1 ?v8)
:precondition (and (pred_4 ?v1) (pred_8 ?v8) 
                  (pred_11 ?v1) (pred_9 ?v8))
:effect (and (pred_12 ) (pred_1 ?v8 ?v1) (not (pred_9 ?v8)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_05 obj_20 obj_21 obj_18 obj_08 obj_06 obj_04 obj_09 obj_02 obj_12 obj_16 obj_14 obj_19 obj_01 obj_10 obj_03
    obj_11 obj_07
    obj_17 obj_13 obj_15
    )

    (:init
       (pred_12)

       (pred_4 obj_05)
       (pred_4 obj_20)
       (pred_4 obj_21)
       (pred_4 obj_18)
       (pred_4 obj_08)
       (pred_4 obj_06)
       (pred_4 obj_04)
       (pred_4 obj_09)
       (pred_4 obj_02)
       (pred_4 obj_12)
       (pred_4 obj_16)
       (pred_4 obj_14)
       (pred_4 obj_19)
       (pred_4 obj_01)
       (pred_4 obj_10)
       (pred_4 obj_03)
       (pred_7 obj_11)
       (pred_7 obj_07)
       (pred_8 obj_17)
       (pred_8 obj_13)
       (pred_8 obj_15)

       (pred_10 obj_05 obj_08)
       (pred_10 obj_05 obj_20)
       (pred_10 obj_20 obj_06)
       (pred_10 obj_20 obj_21)
       (pred_10 obj_20 obj_05)
       (pred_10 obj_21 obj_04)
       (pred_10 obj_21 obj_18)
       (pred_10 obj_21 obj_20)
       (pred_10 obj_18 obj_09)
       (pred_10 obj_18 obj_21)
       (pred_10 obj_08 obj_02)
       (pred_10 obj_08 obj_06)
       (pred_10 obj_08 obj_05)
       (pred_10 obj_06 obj_12)
       (pred_10 obj_06 obj_04)
       (pred_10 obj_06 obj_20)
       (pred_10 obj_06 obj_08)
       (pred_10 obj_04 obj_16)
       (pred_10 obj_04 obj_09)
       (pred_10 obj_04 obj_21)
       (pred_10 obj_04 obj_06)
       (pred_10 obj_09 obj_14)
       (pred_10 obj_09 obj_18)
       (pred_10 obj_09 obj_04)
       (pred_10 obj_02 obj_19)
       (pred_10 obj_02 obj_12)
       (pred_10 obj_02 obj_08)
       (pred_10 obj_12 obj_01)
       (pred_10 obj_12 obj_16)
       (pred_10 obj_12 obj_06)
       (pred_10 obj_12 obj_02)
       (pred_10 obj_16 obj_10)
       (pred_10 obj_16 obj_14)
       (pred_10 obj_16 obj_04)
       (pred_10 obj_16 obj_12)
       (pred_10 obj_14 obj_03)
       (pred_10 obj_14 obj_09)
       (pred_10 obj_14 obj_16)
       (pred_10 obj_19 obj_01)
       (pred_10 obj_19 obj_02)
       (pred_10 obj_01 obj_10)
       (pred_10 obj_01 obj_12)
       (pred_10 obj_01 obj_19)
       (pred_10 obj_10 obj_03)
       (pred_10 obj_10 obj_16)
       (pred_10 obj_10 obj_01)
       (pred_10 obj_03 obj_14)
       (pred_10 obj_03 obj_10)
       (pred_3 obj_18)
       (pred_3 obj_10)
       (pred_3 obj_06)
       (pred_5  obj_18 obj_11)
       (pred_5  obj_10 obj_07)
       (pred_5  obj_06 obj_07)
       (pred_2 obj_05)
       (pred_2 obj_20)
       (pred_2 obj_21)
       (pred_2 obj_08)
       (pred_2 obj_04)
       (pred_2 obj_09)
       (pred_2 obj_02)
       (pred_2 obj_12)
       (pred_2 obj_16)
       (pred_2 obj_14)
       (pred_2 obj_19)
       (pred_2 obj_01)
       (pred_2 obj_03)

       (pred_6  obj_17 obj_11)
       (pred_6  obj_13 obj_07)
       (pred_6  obj_15 obj_07)
       (pred_1 obj_17 obj_08)
       (pred_1 obj_13 obj_05)
       (pred_1 obj_15 obj_09)
       (pred_11 obj_16)
    )

    (:goal (and
       (pred_1 obj_17 obj_19)
       (pred_1 obj_13 obj_21)
       (pred_1 obj_15 obj_02)
    ))
(:constraints
  (always (not (pred_11 obj_20)))
)
)

; plan
1. (op_2 obj_16 obj_12)
   deleted: (pred_11 obj_16)
   added: (pred_11 obj_12)
   goals met: 0 of 3
2. (op_2 obj_12 obj_02)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_02)
   goals met: 0 of 3
3. (op_2 obj_02 obj_08)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_08)
   goals met: 0 of 3
4. (op_1 obj_08 obj_17)
   deleted: (pred_1 obj_17 obj_08) (pred_12)
   added: (pred_9 obj_17)
   goals met: 0 of 3
5. (op_2 obj_08 obj_02)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_02)
   goals met: 0 of 3
6. (op_3 obj_02 obj_17)
   deleted: (pred_9 obj_17)
   added: (pred_12) (pred_1 obj_17 obj_02)
   goals met: 0 of 3
7. (op_2 obj_02 obj_08)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_08)
   goals met: 0 of 3
8. (op_2 obj_08 obj_05)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_05)
   goals met: 0 of 3
9. (op_1 obj_05 obj_13)
   deleted: (pred_1 obj_13 obj_05) (pred_12)
   added: (pred_9 obj_13)
   goals met: 0 of 3
10. (op_2 obj_05 obj_08)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_08)
   goals met: 0 of 3
11. (op_2 obj_08 obj_02)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_02)
   goals met: 0 of 3
12. (op_2 obj_02 obj_12)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_12)
   goals met: 0 of 3
13. (op_2 obj_12 obj_16)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_16)
   goals met: 0 of 3
14. (op_2 obj_16 obj_04)
   deleted: (pred_11 obj_16)
   added: (pred_11 obj_04)
   goals met: 0 of 3
15. (op_2 obj_04 obj_21)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_21)
   goals met: 0 of 3
16. (op_3 obj_21 obj_13)
   deleted: (pred_9 obj_13)
   added: (pred_12) (pred_1 obj_13 obj_21)
   goals met: 1 of 3
17. (op_2 obj_21 obj_04)
   deleted: (pred_11 obj_21)
   added: (pred_11 obj_04)
   goals met: 1 of 3
18. (op_2 obj_04 obj_09)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_09)
   goals met: 1 of 3
19. (op_1 obj_09 obj_15)
   deleted: (pred_1 obj_15 obj_09) (pred_12)
   added: (pred_9 obj_15)
   goals met: 1 of 3
20. (op_2 obj_09 obj_04)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_04)
   goals met: 1 of 3
21. (op_2 obj_04 obj_16)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_16)
   goals met: 1 of 3
22. (op_2 obj_16 obj_12)
   deleted: (pred_11 obj_16)
   added: (pred_11 obj_12)
   goals met: 1 of 3
23. (op_2 obj_12 obj_02)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_02)
   goals met: 1 of 3
24. (op_4 obj_02 obj_17 obj_15)
   deleted: (pred_9 obj_15) (pred_1 obj_17 obj_02)
   added: (pred_9 obj_17) (pred_1 obj_15 obj_02)
   goals met: 2 of 3
25. (op_2 obj_02 obj_19)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_19)
   goals met: 2 of 3
26. (op_3 obj_19 obj_17)
   deleted: (pred_9 obj_17)
   added: (pred_12) (pred_1 obj_17 obj_19)
   goals met: 3 of 3
